package com.tistory.tresed.chinesememorizer;

/**
 * Created by bw on 2016-10-06.
 */

public class WordList {
    String[][] letter, pronounce, mean;
    boolean isAllwords;
    final String[] contentName = {
            "1. 我爱你",
            "2. 明天你来吗?",
            "3. 这是什么茶?",
            "4. 味道怎么样?",
            "5. 你是哪国人？",
            /*"6. 她多大了？",
            "7. 你的生日是几月几号？",
            "8. 国家图书馆在哪儿？",
            "9. 一共多少钱？",
            "10. 你想看什么电影？"*/
    };
    public WordList(){
        isAllwords = false;
        letter = new String[][]{
                {"我", "爱", "你", "他", "她", "妈妈", "爸爸", "也", "我们", "都", "他们"},
                {"金善美", "你好", "林芳", "明天", "来", "吗", "呢", "那", "见", "好", "再", "再见"},
                {"这", "是", "什么", "茶", "茉莉花", "韩国", "的", "不", "中国", "好喝", "很", "中国人", "喜欢", "喝"},
                {"想", "吃", "炸酱面", "炒饭", "服务员", "点", "菜", "味道", "怎么样", "不错", "小", "和"},
                {"王宁", "叫", "名字", "姓", "哪", "国", "人", "韩国人", "是的", "认识", "高兴", "今天", "上午", "了", "一", "个", "朋友", "真"},
                {},
                {},
                {},
                {},
                {}
        };
        pronounce = new String[][]{
                {"wǒ", "ài", "nǐ", "tā", "tā", "māma", "bàba", "yě", "wǒmen", "dōu", "tāmen"},
                {"Jīn Shànměi", "nǐhǎo", "Lín Fāng", "míngtiān", "lái", "ma", "ne", "nà", "jiàn", "hǎo", "zài", "zàijiàn"},
                {"zhè, zhèi", "shì", "shénme", "chá", "mòlìhuā", "Hánguó", "de", "bù", "Zhōngguó", "hǎohē", "hěn", "Zhōngguó rén", "xǐhuan", "hē"},
                {"xiǎng", "chī", "zhájiàngmiàn", "chǎofàn", "fúwùyuán", "diǎn", "cài", "wèidao", "zěnmeyàng", "búcuò", "xiǎo", "hé"},
                {"Wáng Níng","jiào","míngzi","xìng","nǎ / něi","guó","rén","Hánguó rén","shìde","rènshi","gāoxìng","jīntiān","shàngwǔ","le","yī","ge","péngyou","zhēn"},
                {},
                {},
                {},
                {},
                {}
        };
        mean = new String[][]{
                {"나", "사랑하다", "너", "그", "그녀", "엄마", "아빠", "또한", "우리", "모두", "그들"},
                {"김선미[인명]", "안녕[만날 때]", "린팡[인명]", "내일", "오다", "[문장 끝에서 의문을 나타냄]", "[문장 끝에서 생략 의문을 나타냄]", "그러면", "만나다", "좋다", "다시, 또", "안녕[헤어질 때]"},
                {"이, 이것", "~이다", "무엇, 무슨", "차","재스민","한국","~의, ~하는사람", "~이 아니다", "중국", "맛있다", "매우, 아주", "중국 사람", "좋아하다", "마시다"},
                {"~을 바라다", "먹다", "자장면", "볶음밥", "종업원", "주문하다", "요리", "맛", "어떻다", "괜찮다", "[나이 어린 사람 호칭]", "~와, ~과"},
                {"왕닝[인명]", "~라고 부르다", "이름", "성씨", "어느, 어떤", "나라", "사람", "한국 사람", "그렇다[동의]", "알다", "기쁘다", "오늘", "오전", "[동사 뒤에서 동작이 완료됨을 나타냄]", "일, 하나", "개, 명", "친구", "정말, 참으로"},
                {},
                {},
                {},
                {},
                {}
        };
    }
    public WordList(boolean isAll){
        isAllwords = true;
        letter = new String[][]{
                {},
                {"拜拜", "韩国", "中国", "后天", "今年", "去", "老师", "学校", "(电子)图书馆", "葡萄", "书包", "吃", "苹果", "看书", "对不起", "没关系", "不客气"},
                {"学生", "老师", "杯子", "花", "书", "为什么", "什么时候", "买", "好看", "手机", "贵", "便宜", "歌儿", "好听", "听", "好吃", "可乐", "面条", "电影", "汉语", "绿茶", "女的", "男的"},
                {},
                {},
                {},
                {},
                {},
                {},
                {}
        };
        pronounce = new String[][]{
                {},
                {"bàibài", "Hánguó", "Zhōngguó", "hòutiān", "jīnnián", "qù", "lǎoshī", "xuéxiào", "túshūguǎn", "pútáo", "shūbāo", "chī", "píngguǒ", "kàn shū", "duìbuqǐ", "méiguānxi", "búkèqi"},
                {"xuésheng","lǎoshī","bēizi","huā","shū","wèishénme","shénme shíhòu","mǎi","hǎokàn","shǒujī","guì","piányi","gēr","hǎotīng","tīng","hǎochī","kělè","miàntiáo","diànyǐng","Hànyǔ","lǜchá","nǚde","nánde"},
                {},
                {},
                {},
                {},
                {},
                {},
                {}
        };
        mean = new String[][]{
                {},
                {"안녕", "한국", "중국", "모레", "올해", "가다", "선생님", "학교", "도서관", "포도", "책가방", "먹다", "사과", "책을보다", "미안합니다", "괜찮아요", "천만에요"},
                {"학생", "선생님", "컵", "꽃", "책", "왜, 어째서", "언제", "사다", "예쁘다", "핸드폰", "비싸다", "싸다", "노래", "듣기 좋다", "듣다", "맛있다", "콜라", "국수", "영화", "중국어", "녹차", "여자", "남자"},
                {},
                {},
                {},
                {},
                {},
                {},
                {}
        };

    }
}
